Backrooms/src/Enums/ТипыАккаунтов/ТипыАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАккаунтов</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>Участник</name>
  </enumValues>
  <enumValues>
    <name>Учащийся</name>
  </enumValues>
</mdclass:Enum>

Backrooms/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАккаунта</name>
    <type>
      <types>EnumRef.ТипыАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Backrooms/src/HTTPServices/HTTPСервис/Module.bsl
Функция ПользовательНайден(СтрокаJSON)Экспорт
	
	 ЧтениеJSON = Новый ЧтениеJSON();
	 ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	 
	 НоменклатураМассив = ПрочитатьJSON(ЧтениеJSON);
	 Для Каждого СтрокаМассива Из НоменклатураМассив Цикл
	 	Логин = Справочники.Пользователи.НайтиПоРеквизиту("Логин", СтрокаМассива.Логин); 
	 	Если Логин.Пустая() Тогда
			СоздатьНоменклатуру(СтрокаМассива);
			Возврат Ложь;
	 	Иначе
	 		Возврат Истина;
	 	КонецЕсли
	 КонецЦикла;

 КонецФункции
 
 Процедура СоздатьНоменклатуру(СтруктураСДанными)
	 
	НоменклатураОбъект = Справочники.Пользователи.СоздатьЭлемент();
	НоменклатураОбъект.Наименование = СтруктураСДанными.Наименование;
	НоменклатураОбъект.Логин = СтруктураСДанными.Логин;
	НоменклатураОбъект.НомерТелефона = СтруктураСДанными.НомерТелефона;
	НоменклатураОбъект.Пароль = СтруктураСДанными.Пароль;
	НоменклатураОбъект.ТипАккаунта = Перечисления.ТипыАккаунтов.Участник;
	
	НоменклатураОбъект.Записать();
	 
 КонецПроцедуры

Функция РегистрацияPOST(Запрос)
	
	СтрокаНоменклатураJSON = Запрос.ПолучитьТелоКакСтроку();
	ПользовательНайден = ПользовательНайден(СтрокаНоменклатураJSON);
	Если ПользовательНайден Тогда
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Пользоваттель существует");
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки("Пользоваттель успешно зарегистрирован");
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции
